Revit 2027 API
RebarContainerParameterManager.GetIntOverrideValue Method
 Get the integer value for an overriden parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetIntOverrideValue(
	ElementId paramId
)
Public Function GetIntOverrideValue (
	paramId As ElementId
) As Integer
public:
int GetIntOverrideValue(
	ElementId^ paramId
)
member GetIntOverrideValue :
        paramId : ElementId -> int
Parameters
paramId ElementId
 The id of the parameter
Return Value
Int32
 The override value of the parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not the id of a parameter in the current document, or its value type is not integer. -or- paramId is not a Rebar Container parameter -or- paramId has no override
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace